Repository: pingfangx/TranslatorX-other
Catalog: AndroidGuide/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: These APIs update the properties of your View objects over a period of time, continuously redrawing the view as the properties change.
zh_cn: 这些 API 在一段时间内更新 View 对象的属性，并随着属性的变化不断重新绘制视图。

source: These animations give users feedback on their actions and help keep them oriented to the UI.
zh_cn: 这些动画为用户提供有关其操作的反馈，并帮助他们保持面向 UI。

source: These broadcasts are sent when an event of interest occurs.
zh_cn: 这些广播在发生感兴趣的事件时发送。

source: These calls are crucial to ensure that the view behaves reliably.
zh_cn: 这些调用对于确保 view 可靠地运行至关重要。

source: These deep view hierarchies cause performance problems.
zh_cn: 这些深层 view 层次结构会导致性能问题。

source: These endpoints are centered vertically (via app:layout_constraintTop_toTopOf="parent" and app:layout_constraintBottom_toBottomOf="parent").
zh_cn: 这些端点被垂直居中(通过 app:layout_constraintTop_toTopOf="parent" 和 app:layout_constraintBottom_toBottomOf="parent")。

source: These endpoints are defined in the <ConstraintSet> elements later in the MotionScene.
zh_cn: 这些端点将在后面的在 MotionScene 的 <ConstraintSet> 元素定义。

source: These process types are (in order of importance):
zh_cn: 这些进程类型是(按重要性排序)：

source: These processes are considered extremely important and will not be killed unless doing so is required to keep all foreground processes running.
zh_cn: 这些进程被认为是非常重要的，并且不会被杀死，除非需要这样做来保持所有前台进程运行。

source: These processes are kept in a pseudo-LRU list, where the last process on the list is the first killed to reclaim memory.
zh_cn: 这些进程保存在伪 LRU 列表中，其中列表中的最后一个进程是第一个被终止以回收内存的进程。

source: These processes have no direct impact on the user experience.
zh_cn: 这些进程对用户体验没有直接影响。

source: These processes often hold one or more Activity instances that are not currently visible to the user (the onStop() method has been called and returned).
zh_cn: 这些进程通常保存一个或多个用户当前不可见的 Activity 实例(调用了 onStop() 方法并返回)。

source: These symbols represent the size mode as follows (click the symbol to toggle between these settings):
zh_cn: 这些符号表示大小模式，如下所示(单击该符号可在这些设置之间切换)：

source: They are especially useful when the UI changes state, such as when new content loads or new actions become available.
zh_cn: 当 UI 更改状态时(例如新内容加载或新操作可用时)，它们特别有用。

source: They do not animate other attributes (such as color).
zh_cn: 它们不动画的其他属性(例如颜色)。

source: They take the timing data that is provided by an Animator class, the animation's start and end value, and calculate the animated values of the property based on this data.
zh_cn: 它们获取由 Animator 类提供的计时数据、动画的开始和结束值，并基于此数据计算属性的动画值。

source: This allows you to specify several static drawable files that will be displayed one at a time to create an animation.
zh_cn: 这允许你指定几个静态 drawable files，这些文件将一次显示一个以创建动画。

source: This allows your existing animation effects to be accelerated, decelerated, repeated, bounced, etc.
zh_cn: 这允许你现有的动画效果被加速、减速、重复、弹跳等。

source: This animation XML will apply the interpolator:
zh_cn: 这个动画 XML 将运用插值器：

source: This animation runs for just three frames.
zh_cn: 这个动画只有三帧。

source: This application code will apply the animation to an ImageView and start the animation:
zh_cn: 此应用程序代码将动画应用于 ImageView 并启动动画：

source: This application code will set the animation as the background for a View, then play the animation:
zh_cn: 此应用程序代码将动画设置为视图的背景，然后播放动画：

source: This bundle of options may include which views are shared between the activities so the transition framework can connect them during the animation.
zh_cn: 该选项 bundle 可能包括 activity 之间共享的视图，以便过渡框架可以在动画期间连接它们。

source: This class updates the property accordingly when it computes a new value for the animation.
zh_cn: 此类在计算动画的新值时相应地更新属性。

source: This code declares two custom attributes, showText and labelPosition, that belong to a styleable entity named PieChart.
zh_cn: 此代码声明了两个自定义属性 showText 和 labelPosition，它们属于名为 PieChart 的 styleable 实体。

source: This constructor allows the layout editor to create and edit an instance of your view.
zh_cn: 此构造函数允许布局编辑器创建和编辑 view 的实例。

source: This directive assigns the alias custom to the namespace http://schemas.android.com/apk/res/com.example.customviews.
zh_cn: 此伪指令将别名 custom 分配给命名空间 http://schemas.android.com/apk/res/com.example.customviews。

source: This example overrides only one method, onDraw(), but you might need to override others as you create your own custom components.
zh_cn: 此示例仅覆盖一个方法 onDraw()，但你可能需要在创建自己的自定义组件时覆盖其他方法。

source: This gesture makes sense if the UI responds by moving quickly in the direction of the fling, then slowing down, as if the user had pushed on a flywheel and set it spinning.
zh_cn: 如果 UI 通过快速朝向投掷方向移动来响应，然后减速，则该手势是有意义的，就好像用户已经按下飞轮并将其旋转一样。

source: This helper returns an appropriate View.MeasureSpec value by comparing the view's desired size to the spec passed into onMeasure().
zh_cn: 此助手通过将 view 的所需大小与传递到 onMeasure() 的 spec 进行比较，返回适当的 View.MeasureSpec 值。

source: This helps avoid situations where very long running services with memory leaks or other problems consume so much RAM that they prevent the system from making effective use of cached processes.
zh_cn: 这有助于避免长时间运行的带有内存泄漏或其他问题的服务消耗大量 RAM，从而阻止系统有效使用缓存进程的情况。

source: This includes users with disabilities that prevent them from seeing or using a touchscreen.
zh_cn: 这包括看到或使用触摸屏有困难的残障用户。

source: This is a cleaner way to create inner classes if they do not need access to state from the outer class, keeps the generated class small, and allows it to be used easily from other classes.
zh_cn: 如果他们不需要从外部类访问状态，这是一个更简洁的方法来创建内部类，它可以让生成的类更小，而且方便从其他类访问。

source: This is a traditional animation in the sense that it is created with a sequence of different images, played in order, like a roll of film.
zh_cn: 这是一个传统的动画，从某种意义上说，它是由一系列不同的图像组成的，按顺序播放，就像一卷电影。

source: This is an example of an animation with linear interpolation, meaning the object moves at a constant speed.
zh_cn: 这是一个带有线性插值的动画示例，表示对象以恒定速度移动。

source: This is based on the same transition framework described above to animate layout changes, but it allows you to create animations between layouts in separate activities.
zh_cn: 这是基于上述相同的过渡框架来 设置布局更改的动画，但它允许你在 separate activities 中的布局之间创建动画。

source: This is called a Normal Broadcast.
zh_cn: 这被称为正常广播。

source: This is especially useful if the work you want to complete in your onReceive() is long enough to cause the UI thread to miss a frame (>16ms), making it better suited for a background thread.
zh_cn: 如果你想在 onReceive() 中完成的工作足够长，以致于 UI 线程错过一个帧(>16ms)，这一点特别有用，使其更适合于后台线程。

source: This is made slightly more complex by the requirements of limits from the parent (which are passed in to the onMeasure() method) and by the requirement to call the setMeasuredDimension() method with the measured width and height once they have been calculated.
zh_cn: 由于 2 个限制使得该方法稍微有点复杂，一是来自父类的限制（通过 onMeasure() 方法传递），2 是当测量出宽高后需要调用 setMeasuredDimension() 方法。

source: This is more efficient, but means that receivers cannot read results from other receivers, propagate data received from the broadcast, or abort the broadcast.
zh_cn: 这更有效，但意味着接收器无法读取其他接收器的结果、传播从广播接收到的数据或中止广播。

source: This is not a perfect example, and the APIs for doing this might change, but it does demonstrate the principles.
zh_cn: 这不是一个完美的例子，用于这样做的 API 可能会更改，但它确实证明了这些原则。

source: This is particularly important when the layout is inflated repeatedly, such as when used in a ListView or GridView.
zh_cn: 当布局重复加载时(例如在 ListView 或 GridView 中使用时)，这一点尤为重要。

source: This is similar to the on... events in Activity or ListActivity that you override for lifecycle and other functionality hooks.
zh_cn: 这和在 Activity 或 ListActivity 中的 on... 事件一样，你可以重写生命周期或其他一些有用 hook。

source: This is the default behavior.
zh_cn: 这是默认的行为。

source: This is the default.
zh_cn: 这是默认值。

source: This is useful because it controls access to them but isn't necessary (perhaps you want to create a new public View for wider use in your application).
zh_cn: 定义为内部类是有用的但不是必须的。有用是因为它可以控制对它的访问，不是必须是因为你可能想要创建一个公用的类来在应用中广泛使用。

source: This is useful if you want to display a custom loading animation comprised of several images, or if you want one icon to morph into another after a user's action.
zh_cn: 如果要显示由多个图像组成的自定义加载动画，或者在用户操作后希望一个图标变形为另一个图标，则这非常有用。

source: This is useful when you want to constrain a view to the a set of views rather than to one specific view.
zh_cn: 当你希望将视图约束到一组视图而不是一个特定视图时，这非常有用。

source: This keeps the broadcast active after returning from onReceive().
zh_cn: 从 onReceive() 返回后，这将使广播保持活动状态。

source: This layout shows a small bitmap image on the left and two stacked items of text on the right.
zh_cn: 此布局在左侧显示一个小位图图像，在右侧显示两个堆叠的文本项。

source: This lesson covers some of the most common operations.
zh_cn: 本课程介绍了一些最常见的操作。

source: This lesson demonstrates how to use features of the Android framework to add these real-world behaviors to your custom view.
zh_cn: 本课程演示如何使用 Android 框架的功能将这些真实行为添加到自定义view中。

source: This lesson discusses how to use the Android framework to create the core functionality of a view class.
zh_cn: 本类讨论如何使用 Android 框架创建视图类的核心函数式。

source: This lesson shows how you can improve your layout's initialization performance by loading portions of your layout on demand.
zh_cn: 本课演示如何通过按需加载部分布局来提高布局的初始化性能。

source: This lesson shows how you can use SDK tools to inspect your layout and discover performance bottlenecks.
zh_cn: 本课介绍如何使用 SDK 工具检查布局并发现性能瓶颈。

source: This may occur, for example, if the foreground Activity is displayed as a dialog that allows the previous Activity to be seen behind it.
zh_cn: 这可能会发生，例如，如果前台 Activity 显示为一个对话框，允许在它后面观察前一个 Activity。

source: This means that you can instantly show any point within the transition based on some condition, such as touch input.
zh_cn: 这意味着你可以根据某些条件(例如触摸输入)立即显示转换中的任何点。

source: This method passes back a TypedArray array of values that have already been dereferenced and styled.
zh_cn: 此方法传回已取消引用和样式化的 TypedArray 值数组。

source: This method's parameters are View.MeasureSpec values that tell you how big your view's parent wants your view to be, and whether that size is a hard maximum or just a suggestion.
zh_cn: 此方法的参数是 View.MeasureSpec 值，用于告诉你 view 的父级想要 view 的大小，以及该大小是最大值还是仅仅是建议。

source: This must be the root element.
zh_cn: 这必须是根元素。

source: This object is valid only for the duration of the call to onReceive(Context, Intent).
zh_cn: 此对象仅在调用 onReceive(Context, Intent) 时有效。

source: This page provides a guide to building a layout with ConstraintLayout in Android Studio 3.0 or higher.
zh_cn: 本页提供了在 Android Studio 3.0 或更高版本中使用 ConstraintLayout 构建布局的指南。

source: This phenomenon is called double taxation.
zh_cn: 这种现象被称为 double taxation (双重征税)。

source: This point can be the edge of another view, the edge of the layout, or a guideline.
zh_cn: 锚点可以是另一个 view 的边缘，布局的边缘，或一个参考线。

source: This process is created for the application when some of its code needs to be run, and will remain running until it is no longer needed and the system needs to reclaim its memory for use by other applications.
zh_cn: 此进程是在应用程序的某些代码需要运行时为其创建的，并将保持运行状态，直到不再需要它为止 并且 系统需要回收其内存以供其他应用程序使用。

source: This process results in a more natural-looking animation, as shown in figure 4.
zh_cn: 这个过程会产生一个更自然的动画，如图 4 所示。

source: This section discusses how to define custom attributes and specify their values.
zh_cn: 本节讨论如何定义自定义属性并指定其值。

source: This step is necessary because all gestures begin with an onDown() message.
zh_cn: 此步骤是必要的，因为所有手势都以 onDown() 消息开头。

source: This takes a dp dimension for the view's maximum width.
zh_cn: 这需要一个 dp 尺寸作为视图的最大宽度。

source: This takes a dp dimension for the view's minimum width.
zh_cn: 这需要一个 dp 尺寸作为视图的最小宽度。

source: This technique is slightly more complex to set up, but it works more closely with the animation system and doesn't require potentially unnecessary view invalidation.
zh_cn: 这种技术设置稍微复杂一些，但它与动画系统的关系更为密切，并且不需要潜在的不必要的 view 失效调用。

source: This technique requires that you compute scroll offsets in onDraw() and call postInvalidate() every time the scroll offset changes.
zh_cn: 此技术要求你在 onDraw() 中计算滚动偏移，并在每次滚动偏移时调用 postInvalidate() 变化。

source: This way, you can ensure that all views in the barrier always align to each other, even if you don't know which view will be the longest or tallest.
zh_cn: 通过这种方式，可以确保在屏障所有视图始终对准对方，即使你不知道哪个视图将是最长或最高。

source: Though these processes are not directly visible to the user, they are generally doing things that the user cares about (such as background mp3 playback or background network data upload or download), so the system will always keep such processes running unless there is not enough memory to retain all foreground and visible process.
zh_cn: 虽然这些进程对用户不直接可见，但它们通常都在做用户关心的事情(如后台 MP3 播放或后台网络数据上传或下载)，因此系统将始终保持这些进程的运行，除非没有足够的内存来保留所有的前台和可见进程。

source: Though these processes are not directly visible to the user, they are generally doing things that the user cares about (such as background network data upload or download), so the system will always keep such processes running unless there is not enough memory to retain all foreground and visible processes.
zh_cn: 虽然这些进程对用户不直接可见，但它们通常都在做用户关心的事情(如后台网络数据上传或下载)，因此系统将始终保持这些进程的运行，除非没有足够的内存来保留所有前台和可见的进程。

source: Time interpolation: You can specify how the values for the property are calculated as a function of the animation's current elapsed time.
zh_cn: 时间插值：可以指定如何根据动画的当前运行时间计算属性值。

source: To add a built-in View to your user interface, you specify it in an XML element and control its appearance and behavior with element attributes.
zh_cn: 要将内置的 View 添加到用户界面，可以在 XML 元素中指定它并使用元素属性控制其外观和行为。

source: To add a constraint, do the following:
zh_cn: 要添加约束，请执行以下操作：

source: To allow Android Studio to interact with your view, at a minimum you must provide a constructor that takes a Context and an AttributeSet object as parameters.
zh_cn: 要允许 Android Studio 与你的 view 进行交互，你必须至少提供一个构造函数，该构造函数接受 Context 和 AttributeSet 对象作为参数。

source: To animate something, you specify the object property that you want to animate, such as an object's position on the screen, how long you want to animate it for, and what values you want to animate between.
zh_cn: 要设置某个对象的动画，可以指定要设置动画的对象属性，例如对象在屏幕上的位置、要设置动画的时间以及要在其间设置动画的值。

source: To avoid a UI that feels sluggish or stutters during playback, ensure that animations consistently run at 60 frames per second.
zh_cn: 为避免在播放过程中感觉迟缓或不流畅的 UI，请确保动画始终以每秒 60 帧的速度运行。

source: To avoid including such a redundant view group, you can instead use the <merge> element as the root view for the re-usable layout.
zh_cn: 为了避免包含这样的冗余视图组，你可以使用 <merge> 元素作为可重用布局的根视图。

source: To avoid this, prefer using context registration over manifest declaration.
zh_cn: 为了避免这种情况，最好使用上下文注册而不是清单声明。

source: To avoid this, you should either call goAsync() (if you want a little more time to process the broadcast in a background thread) or schedule a JobService from the receiver using the JobScheduler, so the system knows that the process continues to perform active work.
zh_cn: 为了避免这种情况，你应该调用 goAsync()(如果你希望有更多的时间在后台线程中处理广播)，或者使用 JobScheduler 从接收器调度 JobService，以便系统知道该进程继续执行活动工作。

source: To better understand when you should use animations, also see the material design guide to motion.
zh_cn: 为了更好地理解什么时候应该使用动画，也请参阅 material design guide To motion。

source: To build an animation using ConstraintSets, specify two layout files which act as a start and end keyframe for the animation.
zh_cn: 若要使用 ConstraintSets 生成动画，请指定两个布局文件作为动画的开始和结束关键帧。

source: To convert an existing layout to a constraint layout, follow these steps:
zh_cn: 要将现有布局转换为约束布局，请按照下列步骤操作：

source: To convert raw touch events into gestures, Android provides GestureDetector.
zh_cn: 要将原始触摸事件转换为手势，Android 提供 GestureDetector。

source: To create a barrier, follow these steps:
zh_cn: 要创建屏障，请执行以下步骤：

source: To create a baseline constraint, right-click the text view you want to constrain and then click Show Baseline.
zh_cn: 要创建基线约束，请右键单击要约束的文本视图，然后单击 Show Baseline。

source: To create a chain, select all of the views to be included in the chain, right-click one of the views, select Chains and then select either Center Horizontally or Center Vertically, as shown in video 4:
zh_cn: 要创建链，请选择要包含在链中的所有视图，右键单击其中一个视图，选择 Chains，然后选择 Center Horizontally 或 Center Vertically，如视频 4 所示：

source: To create a compound component:
zh_cn: 要创建一个组合组件：

source: To create a fully customized component:
zh_cn: 要创建一个完全自定义的组件：

source: To create a guideline, click Guidelines in the toolbar, and then click either Add Vertical Guideline or Add Horizontal Guideline.
zh_cn: 要创建参考线，请单击工具栏中的 Guidelines，然后单击 Add Vertical Guideline 或 Add Horizontal Guideline。

source: To create these animations with the least amount of effort, you can enable animations on your layout so that when you simply change the visibility of a view, an animation applies automatically.
zh_cn: 若要以最少的工作量创建这些动画，可以在布局上启用动画，以便仅更改视图的可见性时，动画将自动应用。

source: To declare a broadcast receiver in the manifest, perform the following steps:
zh_cn: 要在清单中声明广播接收器，请执行以下步骤：

source: To define a view's position in ConstraintLayout, you must add at least one horizontal and one vertical constraint for the view.
zh_cn: 要在 ConstraintLayout 中定义 view 的位置，你必须为 view 添加至少一个水平和垂直的约束。

source: To define custom attributes, add <declare-styleable> resources to your project.
zh_cn: 要定义自定义属性，请将 <declare-styleable> 资源添加到项目中。

source: To determine which processes should be killed when low on memory, Android places each process into an "importance hierarchy" based on the components running in them and the state of those components.
zh_cn: 为了确定在内存不足时应该终止哪些进程，Android 根据运行在其中的组件和这些组件的状态将每个进程放入“重要性层次结构”。

source: To efficiently re-use complete layouts, you can use the <include/> and <merge/> tags to embed another layout inside the current layout.
zh_cn: 为了有效地重用完整的布局，可以使用 <include/> 和 <merge/> 标签在当前布局中嵌入另一个布局。

source: To enable the ratio, click Toggle Aspect Ratio Constraint (callout 1 in figure 13), and then enter the width:height ratio in the input that appears.
zh_cn: 要启用比率，点击 Toggle Aspect Ratio Constraint (如图 13 中的编号 1)，然后在出现的输入框中输入 width:height 。

source: To enable this behavior in your custom view, you must:
zh_cn: 要在自定义 view 中启用此行为，你必须：

source: To ensure that all your views are evenly spaced, click Margin in the toolbar to select the default margin for each view that you add to the layout.
zh_cn: 若要确保所有视图的间距均匀，请单击工具栏中的 Margin 以选择添加到布局中的每个视图的默认边距。

source: To get started, watch the video embedded here and read the Animations Overview.
zh_cn: 要开始，看这里的嵌入视频和阅读 Animations Overview。

source: To get this information, call getConnectionInfo() instead.
zh_cn: 要获取此信息，请改为调用 getConnectionInfo()。

source: To give an idea of the control you get with custom views, here are some examples of what you could do with them:
zh_cn: 给控制你自定义 VIew 的一些意见，这里是一些你可做的例子：

source: To help you avoid missing constraints, the Layout Editor can automatically add constraints for you with the Autoconnect and infer constraints features.
zh_cn: 为了帮助我们去避免出现缺少约束的错误，布局编辑器的 Autoconnect and infer constraints 功能可以为你自动添加约束。

source: To keep layout information separate from motion descriptions, each MotionLayout references a separate MotionScene.
zh_cn: 为了使布局信息与运动描述分开，每个 MotionLayout 引用一个单独的 MotionScene。

source: To learn how to build animations with the property animation system, read the Property Animation Overview.
zh_cn: 要了解如何使用属性动画系统构建动画，请阅读 Property Animation Overview。

source: To make several transformations happen simultaneously, give them the same start time; to make them sequential, calculate the start time plus the duration of the preceding transformation.
zh_cn: 若要使多个转换同时发生，请为它们指定相同的开始时间；若要使它们连续，请计算开始时间加上前面转换的持续时间。

source: To make them occur sequentially, you must specify the startOffset attribute, as shown in the example below.
zh_cn: 要使它们按顺序发生，必须指定 startOffset 属性，如下例所示。

source: To move, reveal, or hide views within the current layout, you can use the property animation system provided by the android.animation package, available in Android 3.0 (API level 11) and higher.
zh_cn: 要在当前布局中移动、显示或隐藏视图，可以使用 android.animation 包提供的属性动画系统，该包在 android 3.0(API 级别 11)及更高版本中提供。

source: To provide dynamic behavior, expose a property getter and setter pair for each custom attribute.
zh_cn: 要提供动态行为，请为每个自定义属性公开属性 getter 和 setter 方法。

source: To provide these behaviors, the Android Support library includes physics-based animation APIs that rely on the laws of physics to control how your animations occur.
zh_cn: 为了提供这些行为，Android 支持库包括基于物理的动画 API，它们依赖物理定律来控制动画的发生方式。

source: To receive the broadcast, the receiving app must request the permission as shown below:
zh_cn: 要接收广播，接收应用程序必须请求如下所示的权限：

source: To register a receiver with a context, perform the following steps:
zh_cn: 要用上下文注册接收器，请执行以下步骤：

source: To see a full example of property animation, see the ChangeColor class in the CustomTransition sample on GitHub.
zh_cn: 要查看属性动画的完整示例，请参见 GitHub 上的 CustomTransition 示例中的 ChangeColor 类。

source: To see a variety of layouts you can create with ConstraintLayout, check out the Constraint Layout Examples project on GitHub.
zh_cn: 要查看使用 ConstraintLayout 创建的各种布局，请查看 GitHub 上的 ConstraintLayout 项目： Constraint Layout Examples project on GitHub。

source: To select a different sizing mode, click a view and open the Attributes window on the right side of the editor.
zh_cn: 要选择不同的大小调整模式，请单击视图并打开编辑器右侧的 Attributes 窗口。

source: To speed up your view, eliminate unnecessary code from routines that are called frequently.
zh_cn: 要加快 view 速度，请从频繁调用的例程中删除不必要的代码。

source: To start a fling, call fling() with the starting velocity and the minimum and maximum x and y values of the fling.
zh_cn: 要开始投掷，请使用起始速度以及投掷的最小和最大 x 和 y 值调用 fling()。

source: To start a new constraint layout file, follow these steps:
zh_cn: 要创建新的约束布局文件，请按照下列步骤：

source: To start an animation, create a ValueAnimator and give it the starting and ending values for the property that you want to animate, along with the duration of the animation.
zh_cn: 要启动动画，请创建一个 ValueAnimator，并为其提供要设置动画的属性的开始和结束值以及动画的持续时间。

source: To start with, the platform includes a variety of prebuilt View and ViewGroup subclasses — called widgets and layouts, respectively — that you can use to construct your UI.
zh_cn: 初始时，安卓平台包含了各种预制的 View 和 ViewGroup 的子类，分别叫做 widgets 和 layouts，你可以用它们来创建自己的 UI。

source: To stop receiving broadcasts, call unregisterReceiver(android.content.BroadcastReceiver).
zh_cn: 要停止接收广播，调用 unregisterReceiver(android.content.BroadcastReceiver)。

source: To summarize, the use of a Layout as the basis for a Custom Control has a number of advantages, including:
zh_cn: 总之，使用 Layout 作为自定义控件的基类有一些优点，包括：

source: To support users with disabilities, you should:
zh_cn: 为了支持残障用户，你应该：

source: To use ConstraintLayout in your project, proceed as follows:
zh_cn: 要在项目中使用 ConstraintLayout，按下列步骤进行：

source: To use MotionLayout in your project, add the ConstraintLayout 2.0 dependency to your app's build.gradle file.
zh_cn: 要在项目中使用 MotionLayout，请将 ConstraintLayout2.0 依赖项添加到应用程序的 build.gradle 文件中。

source: To use the animation system, whenever a property changes that will affect your view's appearance, do not change the property directly.
zh_cn: 要使用动画系统，只要属性发生更改会影响 view 的外观，请不要直接更改属性。

source: To use the custom attributes from this class, you would use the tag com.example.customviews.charting.PieChart$PieView.
zh_cn: 要使用此类中的自定义属性，可以使用标记 com.example.customviews.charting.PieChart$PieView。

source: To view the errors and other warnings, click Show Warnings and Errors .
zh_cn: 要查看错误和其他警告，请单击 Show Warnings and Errors 。

source: Touch events by themselves are not particularly useful.
zh_cn: 触摸事件本身并不是特别有用。

source: Transformations can be sequential or simultaneous - for example, you can have the contents of a TextView move from left to right, and then rotate 180 degrees, or you can have the text move and rotate simultaneously.
zh_cn: 转换可以是连续的，也可以是同时的——例如，可以让 TextView 的内容从左向右移动，然后旋转 180 度，或者让文本同时移动和旋转。

source: Tween animation
zh_cn: 补间动画
